Repository: Krisztian03/edzesnaplo_app
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Login
hu: Bejelentkezés

source: Password
hu: Jelszó

source: Register
hu: Regisztráció

# emailEmptyError
source: Email cannot be empty
hu: Az email nem lehet üres

# passwordShortError
source: Password must be at least 6 characters
hu: A jelszónak legalább 6 karakter hosszúnak kell lennie

# alreadyHaveAccount
source: Already have an account?
hu: Már van fiókod?

# dontHaveAccount
source: Don't have an account?
hu: Még nincs fiókod?

source: Confirm Password
hu: Jelszó megerősítése

source: Passwords do not match
hu: A jelszavak nem egyeznek

source: First Name
hu: Keresztnév

# firstNameEmptyError
source: Please enter your first name
hu: Kérlek add meg a keresztneved

# homeGreeting
source: Hello, {name}
hu: Szia, {name}

source: Steps
hu: Lépések

source: Sleep
hu: Alvás

source: Water
hu: Víz

source: Calories
hu: Kalória

source: Home
hu: Főoldal

source: Training
hu: Edzés

source: Exercises
hu: Gyakorlatok

source: Report
hu: Riport

source: Profile
hu: Profil

# statusWalking
source: Walking
hu: Sétál

# statusStopped
source: Stopped
hu: Áll

# mondayShort
source: Mon
hu: Hét

# tuesdayShort
source: Tue
hu: Kedd

# wednesdayShort
source: Wed
hu: Sze

# thursdayShort
source: Thu
hu: Csüt

# fridayShort
source: Fri
hu: Pén

# saturdayShort
source: Sat
hu: Szo

# sundayShort
source: Sun
hu: Vas

source: Step Counter Error!
hu: Lépésszámláló hiba!

source: Pedestrian Status error!
hu: Lépésszámláló státusz hiba!

# invalidAmount
source: Please enter a valid amount!
hu: Adj meg egy érvényes mennyiséget!

# maxPerServingExceeded
source: You can add up to 5 liters per serving!
hu: Egyszerre legfeljebb 5 liter adható hozzá!

# dailyLimitExceeded
source: Youâ€™ve reached the daily limit (10 liters)!
hu: Elérted a napi maximumot (10 liter)!

source: Water intake
hu: Vízfogyasztás

# enterWaterAmount
source: Enter amount in ml
hu: Add meg a mennyiséget (ml)

# waterAddedSuccess
source: Water Added
hu: Sikeresen hozzáadva!

source: Add
hu: Hozzáadás

source: Close
hu: Bezárás

source: Log out
hu: Kijelentkezés

# firstNameInvalidError
source: Only letters with or without accents are allowed!
hu: Csak ékezetes vagy angol betűk lehetnek!

source: Add training
hu: Edzés hozzáadása

# noWorkouts
source: There are no scheduled workouts for this day.
hu: Nincs rögzített edzés erre a napra.

source: Select category
hu: Válassz kategóriát

source: Select exercise
hu: Válassz gyakorlatot

source: Add Workout
hu: Edzés hozzáadása

# chooseCategory
source: Choose a category
hu: Válassz kategóriát

source: Chest
hu: Mell

source: Back
hu: Hát

source: Legs
hu: Láb

source: Arms
hu: Kar

source: Shoulders
hu: Váll

source: Core
hu: Törzs

source: Cardio
hu: Kardió

source: Bench Press
hu: Fekvenyomás

source: Incline Bench Press
hu: Ferdepados nyomás

source: Decline Bench Press
hu: Negatív padon nyomás

source: Chest Fly
hu: Tárogatás

source: Push Ups
hu: Fekvőtámasz

source: Cable Crossover
hu: Kábelkereszt

source: Dips
hu: Tolódzkodás

source: Pull Ups
hu: Húzódzkodás

source: Chin Ups
hu: Állhoz húzás

source: Barbell Row
hu: Evezés rúddal

source: Dumbbell Row
hu: Evezés kézisúlyzóval

source: Lat Pulldown
hu: Lehúzás csigán

source: Deadlift
hu: Felhúzás

source: Face Pull
hu: Archoz húzás

source: T-Bar Row
hu: T-rudas evezés

source: Squats
hu: Guggolás

source: Front Squats
hu: Elől guggolás

source: Lunges
hu: Kitörés

source: Step Ups
hu: Fellépés

source: Leg Press
hu: Lábtoló

source: Romanian Deadlift
hu: Román felhúzás

source: Leg Extension
hu: Lábtoló nyújtás

source: Hamstring Curl
hu: Combhajlító gép

source: Calf Raise
hu: Vádliemelés

source: Bicep Curls
hu: Bicepsz hajlítás

source: Hammer Curls
hu: Kalapács bicepsz

source: Concentration Curl
hu: Koncentrált bicepsz

source: Tricep Pushdown
hu: Tricepsz lenyomás

source: Tricep Dips
hu: Tricepsz tolódzkodás

source: Skull Crushers
hu: Homlokra engedés

source: Overhead Tricep Extension
hu: Tricepsz nyújtás fej fölött

source: Close Grip Bench Press
hu: Szűknyomás

source: Shoulder Press
hu: Vállnyomás

source: Lateral Raise
hu: Oldalemelés

source: Front Raise
hu: Előreemelés

source: Rear Delt Fly
hu: Hátsó váll tárogatás

source: Arnold Press
hu: Arnold nyomás

source: Shrugs
hu: Vállvonogatás

source: Upright Row
hu: Állig húzás

source: Crunches
hu: Hasprés

source: Leg Raises
hu: Lábemelés

source: Russian Twist
hu: Orosz twist

source: Bicycle Crunch
hu: Kerékpár hasprés

source: Mountain Climbers
hu: Hegymászó

source: Hanging Leg Raise
hu: Lógás lábemeléssel

source: Ab Rollout
hu: Hasgörgő

source: Running
hu: Futás

source: Cycling
hu: Kerékpározás

source: Rowing
hu: Evezés

source: Jump Rope
hu: Ugrókötél

source: Stair Climber
hu: Lépcsőzőgép

source: Elliptical
hu: Ellipszis tréner

source: Swimming
hu: Úszás

source: HIIT
hu: HIIT edzés

source: Sets
hu: Sorozatok

source: Reps
hu: Ismétlések

source: Weight (optional)
hu: Súly (opcionális)

source: Save
hu: Mentés

source: Load template
hu: Sablon betöltése
